tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"

# Core utilities to make things like shell and editors work
brew "caddy"
brew "fish"
brew "ctags"
brew "fasd"
brew "fzf"
brew "ripgrep"
brew "the_silver_searcher"
brew "exa"                                  # I alias `ls` to this

# Neo-CLI and utility replacements
brew "diff-so-fancy"
brew "jq"
brew "httpie"
brew "jid"
brew "htop"
brew "mosh"
brew "neovim"
brew "ncdu"
brew "caddy"                                # instead of python -m SimpleHTTPServer <port>

# Utilities
brew "dos2unix"
brew "gnu-which"                            # seriously?  Why isn't this default?
brew "p7zip"
brew "tcnksm/ghr/ghr"                       # multiple uploads to github for binary releases
brew "tldr"
brew "tmux"
brew "tree"
brew "watch"                                # watch or run a command on a timed interval
brew "wget"                                 # seriously?  Why isn't this default?
brew "coreutils"
brew "fswatch"

# Languages - Some Languages have their own sections
# Unfortunately the usefulness of this is up to you, your taste and your stack
brew "goby-lang/goby"
brew "python3"
cask "java"
brew "elm"
brew "elm-format"

# Ruby
brew "chruby"
brew "chruby-fish"
brew "ruby-build"

# Go
brew "go"
brew "go-delve/delve"

# Node
brew "node"                                 # node.js stable, otherwise use fnm for fish
brew "yarn"                                 # prefer yarn over `npm i -g` when possible for global commands
brew "emscripten"

# Elixir
brew "elixir"

# Java
cask "java"
brew "maven"

# C/C++ Toolchain and libraries
brew "autoconf"
brew "automake"
brew "boost"
brew "cmake"
brew "gettext", link: true
brew "libtool"
brew "llvm"
brew "pkg-config"
brew "readline"

# Databases
brew "postgresql"                           # Just stop here, what else would you need?  :P
brew "redis", restart_service: true
brew "mariadb"                              # Drop-in replacement for mysql
brew "mongodb"                              # The hate deflecting database
brew "rethinkdb"                            # Long live rethinkdb

# Services
brew "memcached"                            # famous and widly used caching server
brew "mosquitto", restart_service: true     # IoT message queue

# Ops
brew "terraform"

# Desktop Apps
cask "phoenix"                              # mac os window moving like Moom etc
cask "launchrocket"                         # system preference pane for starting and stopping homebrew daemons
